app/controllers/features_controller.rb

  def new
    if !params[:project_id].nil? && !Project.find(params[:project_id]).nil?
      @project = Project.find(params[:project_id])
      @feature = @project.features.new
    else
      @feature = Feature.new(:title => params[:title])
    end
    @projects = Project.all
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 2)
SELECT * FROM `projects`