app/controllers/projects_controller.rb

  def index
    @projects = Project.paginate(:page => params[:page],:per_page => 5)
---
SELECT * FROM `projects`

  def new
    @project = Project.new
    @features ||= Feature.find :all
---
SELECT * FROM `features`

  def create
    @project = Project.new(params[:project])
    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`title`, `aim`, `description`) VALUES('dasd', 'sada', 'asdas')

    def find_project
      @project ||= Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 2)

    def find_projects_features
      @project_features = @project.features.paginate(:page => params[:page],:per_page => 5,:order=>"feature_projects.position")
---
SELECT `features`.id FROM `features` INNER JOIN `feature_projects` ON `features`.id = `feature_projects`.feature_id WHERE ((`feature_projects`.project_id = 1))